In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Itachi','Luffy','Naruto','Zoro','Sakura','Nami'],
        'Sales':[500,200,100,900,250,600]
       }

df = pd.DataFrame(data)
df

  Company  Person  Sales
0    GOOG  Itachi    500
1    GOOG   Luffy    200
2    MSFT  Naruto    100
3    MSFT    Zoro    900
4      FB  Sakura    250
5      FB    Nami    600

In [11]:
comps = df.groupby('Company') #making a company object to perform aggregate functions

In [13]:
comps.sum()

              Person  Sales
Company
FB        SakuraNami    850
GOOG     ItachiLuffy    700
MSFT      NarutoZoro   1000

In [27]:
comps.max()

         Person  Sales
Company
FB       Sakura    600
GOOG      Luffy    500
MSFT       Zoro    900

In [35]:
comps.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  425.0  247.487373  250.0  337.5  425.0  512.5  600.0
GOOG      2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
MSFT      2.0  500.0  565.685425  100.0  300.0  500.0  700.0  900.0

In [37]:
comps.describe().loc['MSFT']

Sales  count      2.000000
       mean     500.000000
       std      565.685425
       min      100.000000
       25%      300.000000
       50%      500.000000
       75%      700.000000
       max      900.000000
Name: MSFT, dtype: float64

In [47]:
df.groupby('Company')['Sales'].mean() #for mean and median we have to sometime highlight Numeric col

Company
FB      425.0
GOOG    350.0
MSFT    500.0
Name: Sales, dtype: float64

In [51]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   425.000000  350.000000  500.000000
      std    247.487373  212.132034  565.685425
      min    250.000000  200.000000  100.000000
      25%    337.500000  275.000000  300.000000
      50%    425.000000  350.000000  500.000000
      75%    512.500000  425.000000  700.000000
      max    600.000000  500.000000  900.000000

In [55]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     425.000000
       std      247.487373
       min      250.000000
       25%      337.500000
       50%      425.000000
       75%      512.500000
       max      600.000000
Name: FB, dtype: float64

In [59]:
comps['Sales'].std() #standard deviation

Company
FB      247.487373
GOOG    212.132034
MSFT    565.685425
Name: Sales, dtype: float64